[
    {
        "incident_number": "INC0000015",
        "incident_caller": "Fred Luddy",
        "issue": "being unable to launch his VPN client since the last software update",
        "close_code": "Resolved by caller",
        "close_notes": "Caller restarted laptop and was able to successfully launch the client",
        "goal": "Resolve Fred Luddy's incident about being unable to launch his VPN client since the last software update. Choose \"Resolved by caller\" for the resolution code and put \"Caller restarted laptop and was able to successfully launch the client\" in the resolution notes"
    },
    {
        "incident_number": "INC0000025",
        "incident_caller": "Don Goodliffe",
        "issue": "adding more memory to his laptop",
        "close_code": "Solution provided",
        "close_notes": "Additional memory installed on caller's laptop during a walk-in appointment",
        "goal": "Resolve Don Goodliffe's incident about adding more memory to his laptop. Choose \"Solution provided\" for the resolution code and put \"Additional memory installed on caller's laptop during a walk-in appointment\" in the resolution notes"
    },
    {
        "incident_number": "INC0000057",
        "incident_caller": "Bertie Luby",
        "issue": "performance problems with wifi",
        "close_code": "User error",
        "close_notes": "User was connected to a neighbor's wifi network",
        "goal": "Resolve Bertie Luby's incident about performance problems with wifi. Choose \"User error\" for the resolution code and put \"User was connected to a neighbor's wifi network\" in the resolution notes"
    },
    {
        "incident_number": "INC0009005",
        "incident_caller": "David Miller",
        "issue": "email server being down",
        "close_code": "Known error",
        "close_notes": "Already under investigation, team is working on a fix",
        "goal": "Resolve David Miller's incident about email server being down. Choose \"Known error\" for the resolution code and put \"Already under investigation, team is working on a fix\" in the resolution notes"
    },
    {
        "incident_number": "INC0000055",
        "incident_caller": "Carol Coughlin",
        "issue": "SAP sales app being unaccessible",
        "close_code": "Resolved by change",
        "close_notes": "Resolved this morning by change request",
        "goal": "Resolve Carol Coughlin's incident about SAP sales app being unaccessible. Choose \"Resolved by change\" for the resolution code and put \"Resolved this morning by change request\" in the resolution notes"
    }
]