[
    {
        "item": "Onboarding a new user",
        "article": "<h2>Onboarding a new user</h2> <p>This document outlines the procedure for onboarding a new user within the company. Proper onboarding ensures that new users have the necessary tools and access to start their roles effectively and efficiently. Follow the steps below to complete the onboarding process.</p> <h2>Steps for Onboarding a New User</h2> <h3>1. Create a User Account</h3> <ol> <li>Access the user creation interface.</li> <li>Enter the required information for the new user.</li> <li>Save the new user account.</li> </ol> <p>You can create a user account <a href='./now/nav/ui/classic/params/target/sys_user_list.do'>here</a>.</p> <h3>2. Order a Laptop</h3> <ol> <li>Access the service catalog.</li> <li>Order an Apple MacBook Pro 15\" laptop for the new user.</li> <li>Confirm the order details and submit the request.</li> </ol> <p>You can order the laptop <a href='./now/nav/ui/classic/params/target/catalog_home.do%3Fsysparm_view%3Dcatalog_default'>here</a>.</p> <h3>3. Create a Hardware Asset</h3> <ol> <li>Access the hardware asset management interface.</li> <li>Create a new hardware asset with the required configuration.</li> <li>Assign the newly created hardware asset to the user.</li> </ol> <p>You can create and assign a hardware asset <a href='./now/nav/ui/classic/params/target/alm_hardware_list.do'>here</a>.</p> <h2>Conclusion</h2> <p>Following these steps will ensure that new users are properly onboarded with the necessary equipment and access rights. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to streamline the user onboarding process, ensuring consistency and efficiency across the organization.</p>"
    },
    {
        "item": "Offboarding a user",
        "article": "<h1>Offboarding a user</h1> <h2>Introduction</h2> <p>This document outlines the procedure for offboarding a user within the company. Proper offboarding ensures that company assets are secured and that the departing user's access is properly removed. Follow the steps below to complete the offboarding process.</p> <h2>Steps for Offboarding a User</h2> <h3>1. Un-assign Hardware Assets</h3> <ol> <li>Find the user's laptop by looking for the hardware asset assigned to them.</li> <li>Un-assign the laptop by erasing the \"Assigned to\" field.</li> </ol> <p>You can manage hardware assets <a href='./now/nav/ui/classic/params/target/alm_hardware_list.do'>in the hardware asset list</a>.</p> <h3>2. Delete the User Account</h3> <ol> <li>Access the user management interface.</li> <li>Locate and delete the user account.</li> </ol> <p>You can delete the user account <a href='./now/nav/ui/classic/params/target/sys_user_list.do'>here</a>.</p> <h2>Conclusion</h2> <p>Following these steps will ensure that departing users are properly offboarded and that all company assets and access rights are appropriately managed. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to streamline the user offboarding process, ensuring consistency and security across the organization.</p>"
    },
    {
        "item": "Finding the warranty expiration for a user's laptop",
        "article": "<h1>Finding the Warranty Expiration for a User's Laptop</h1> <h2>Introduction</h2> <p>This document outlines the procedure for finding the warranty expiration date of a user's laptop. Ensuring that the warranty information is up-to-date is crucial for managing hardware assets and planning for replacements or repairs.</p> <h2>Steps to Find the Warranty Expiration Date</h2> <h3>1. Locate the Laptop Assigned to the User</h3> <ol> <li>Find the laptop assigned to the user by looking at the \"Assigned to\" field <a href='./now/nav/ui/classic/params/target/alm_hardware_list.do'>in the hardware asset list</a>.</li> </ol>   <h3>2. Find the Laptop's Warranty Expiration Date</h3> <ol> <li>Once the laptop is located, check the warranty expiration date on the asset details page.</li> </ol> <h2>Conclusion</h2> <p>Following these steps will help you accurately find the warranty expiration date of a user's laptop. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure proper management of hardware warranties within the organization.</p>"
    },
    {
        "item": "Agent Workload Balancing",
        "article": "<h1>Agent Workload Balancing</h1> <h2>Introduction</h2> <p>Agent Workload Balancing is a process designed to distribute work evenly among agents by re-assigning tasks. The problems to re-distribute all contain specific hashtags in their problem statements. By balancing the workload, we ensure that no single agent is overwhelmed while others have fewer tasks. All problems can be found in the <a href='./now/nav/ui/classic/params/target/problem_list.do'>problem list</a>.</p> <h2>Steps for Agent Workload Balancing</h2> <h3>1. Identify Busiest and Least Busy Users</h3> <ol> <li>Among the problems with descriptions containing the required hashtag, identify the user with the most assigned problems and the user with the least assigned problems.</li> <li>This information can be found in the report named 'Problems with hashtag {hashtag_name}'.</li> </ol> <p>You can access the list of reports <a href='./now/nav/ui/classic/params/target/sys_report_list.do'>here</a>.</p> <h3>2. Find a Low Priority Problem</h3> <ol> <li>Locate a problem with the lowest priority (priority=5) that includes the appropriate hashtag in the problem statement and is assigned to the busiest user.</li> </ol> <p>You can filter <a href='./now/nav/ui/classic/params/target/problem_list.do'>the problem list</a> to find such a problem.</p> <h3>3. Re-assign the Problem</h3> <ol> <li>Re-assign the identified low priority problem to the least busy user.</li> </ol> <h2>Conclusion</h2> <p>Following these steps will help balance the workload among agents by re-assigning low priority problems from the busiest to the least busy user. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure effective workload management among agents within the organization.</p>"
    },
    {
        "item": "Work Assignment: Assign Incidents to Relevant Agents",
        "article": "<h1>Work Assignment: Assign Incidents to Relevant Agents</h1> <h2>Introduction</h2> <p>This document outlines the process for assigning incidents to relevant agents based on both the category and the priority of the incident. Proper assignment ensures that incidents are handled by the most appropriate agents, leading to quicker and more effective resolutions. Follow these steps to assign incidents correctly.</p> <h2>Steps for Assigning Incidents</h2> <h3>1. Locate the Incident</h3> <ol> <li>Go to the incidents page and search for the incident using the incident number that needs to be assigned.</li> </ol> <p>You can access the incidents page <a href='./now/nav/ui/classic/params/target/incident_list.do'>here</a>.</p> <h3>2. Identify the Incident Category and Priority</h3> <ol> <li>Look at the category and priority of the incident. The category will be one of the following: 'Hardware', 'Software', 'Network', or 'Database'.</li> <li>Assign the incident to the category experts mentioned in the task description. </li> </ol> <h3>3. Assign the Incident</h3> <ol> <li>If applicable, assign the incident to the relevant agent based on the priority of the incident. The priority levels are as follows: <ul> <li><strong>Priority 1 - Critical:</strong> Assign to the 'expert' of the category.</li> <li><strong>Priority 3 - Moderate:</strong> Assign to the 'supporter' of the category.</li> <li><strong>Priority 5 - Planning:</strong> Assign to the 'planner' of the category.</li> </ul> </li> </ol> <h2>Conclusion</h2> <p>By following these steps, you can ensure that incidents are assigned to the most qualified agents based on their category and priority. This approach leads to faster resolution times and improved efficiency in incident management. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure proper assignment of incidents to relevant agents within the organization.</p>"
    },
    {
        "item": "Edit a knowledge article to manage incorrect information",
        "article": "<h1>Edit a Knowledge Article to Manage Incorrect Information</h1> <h2>Introduction</h2> <p>This document outlines the procedure for editing a knowledge base article that contains incorrect, outdated, or obsolete information. Ensuring that all knowledge articles are accurate and up-to-date is crucial for maintaining the integrity and reliability of the knowledge base.</p> <h2>Steps to Edit a Knowledge Article</h2> <h3>1. Search the Knowledge Base</h3> <ol> <li>Search the knowledge base using the given query.</li> </ol> <p>You can perform the search <a href='./now/nav/ui/classic/params/target/%24knowledge.do'>here</a>.</p> <h3>2. Identify the Correct and Incorrect Articles</h3> <ol> <li>Identify the articles that contain the correct and incorrect information based on what the information should be.</li> </ol> <h3>3. Mark the Incorrect Article</h3> <ol> <li>Add a comment to the article to mark it as 'incorrect' and mention the 'number' of the correct article as per the task description.</li> </ol> <h3>4. Mark the Correct Article</h3> <ol> <li>Add a comment to the article to label it as 'correct' and mention the 'number' of the incorrect article as per the task description to avoid having misguiding people.</li> </ol> <h2>Conclusion</h2> <p>Following these steps will help maintain the accuracy and relevance of the knowledge base by properly marking and referencing articles with correct and incorrect information. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure effective management of information within the knowledge base.</p>"
    },
    {
        "item":"Problem List Cleanup",
        "article": "<h1>Problem List Cleanup</h1> <h2>Introduction</h2> <p>Problem List Cleanup ensures that the problem list remains organized and free from redundancy. In the <a href='./now/nav/ui/classic/params/target/problem_list.do'>problem list</a>, some problem's \"Problem statement\" field contain a hashtag so we know which problem group they belong to. The problem list cleanup involves identifying problems with duplicated problem statements and marking them as duplicates. </p> <h2>Steps for Problem List Cleanup</h2> <h3>1. Identify Duplicated Problems</h3> <ol> <li>Among the problems with problem statements containing the required hashtag, identify those with duplicated problem statements. This can be done by filtering <a href='/now/nav/ui/classic/params/target/problem_list.do'>the problem list</a> .</li> </ol> <h3>2. Mark Duplicated Problems</h3> <ol> <li>If two problems have the same priority, you can mark either one as a duplicate of the other. Otherwise, mark the lowest priority problem as a duplicate of the highest priority one to keep the highest priority problems open. A problem's priority can range from 1 (Critical) to 5 (Planning), with 1 being the highest priority.</li> <li>Marking a problem as duplicate is done by opening the problem record and Clicking \"Mark Duplicate\".</li> </ol> <h3>3. Additional Handling for Critical Priority Problems</h3> <ol> <li>If you need to mark a priority 1 (Critical priority) problem as a duplicate of another, change the description of this problem to \"Duplicate\" to avoid further confusion.</li> </ol> <h2>Conclusion</h2> <p>Following these steps will help maintain a clean and efficient problem list by properly marking and managing duplicated problems. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure effective problem management within the organization.</p>"
    },
    {
        "item": "Scheduling Your Change Requests",
        "article": "<h1>Scheduling Your Change Requests</h1> <h2>Introduction</h2> <p>Scheduling change requests is a critical process in managing IT infrastructure and operations. This process involves organizing and prioritizing change requests to ensure they are implemented efficiently and with minimal disruption to ongoing operations. Change requests often include updates, fixes, or enhancements that need to be scheduled within specific time blocks. The following guidelines outline how to create a valid schedule for change requests. As a first step, we note that change requests are grouped by hashtags placed in their short description. In general, creating a schedule is done for change requests that share a given hashtag and by setting the \"Planned start date\" and \"Planned end date\" for these change requests. Make sure to leave empty the \"Actual start date\" and \"Actual end date\" as they should only be filled when the work has started. All change requests can be found <a href='./now/nav/ui/classic/params/target/change_request_list.do'>here</a>. </p> <h2>Scheduling Rules</h2> <h3>1. Time Constraints</h3> <ol> <li>All change requests must be scheduled within the allowed time frame. They should not start before the start of the schedule block and must end before it closes. Moreover, they should not overlap.</li> </ol> <h3>2. Impact Order</h3> <ol> <li>Higher impact change requests must be scheduled before lower impact ones, ensuring the schedule prioritizes more significant changes.</li> </ol> <h3>3. Consecutive Requests</h3> <ol> <li>Generally, there should be no more than one day between consecutive change requests.</li> <li>If the change requests are required to follow a \"tight\" schedule, there should be no more than one hour between consecutive requests.</li> </ol> <h3>4. Duration Compliance</h3> <ol> <li>All change requests must respect the desired durations, which are determined by the risk level: <ul> <li>High risk: 3 days</li> <li>Moderate risk: 2 days</li> <li>Low risk: 1 day</li> </ul> </li> </ol> <h2>Conclusion</h2> <p>Following these guidelines will help you create an efficient and effective schedule for your change requests, minimizing disruptions and prioritizing higher impact changes. For any issues or additional assistance, please contact the IT department.</p> <hr> <p>This document serves as a guide to ensure proper scheduling and management of change requests within the organization.</p>"
    },
    {
        "item": "Managing Your Existing Expenses",
        "article": "<h1>Managing Your Existing Expenses</h1> <h2>Introduction</h2> <p>Managing your existing expenses is a crucial aspect of maintaining financial accuracy and compliance within the company. This process involves reviewing expense lines to ensure no duplicates remain. Expense lines can be found <a href='./now/nav/ui/classic/params/target/fm_expense_line_list.do'>here</a>. Duplicate expenses can lead to inaccuracies in financial reporting and budget management, making it essential to handle them according to established guidelines. Expense lines normally contain specific hashtags so they can be grouped. The process of filtering the duplicates is done for specific hashtags. </p> <h2>Steps for Managing Expense Duplicates</h2> <h3>1. Identify Duplicate Expenses</h3> <ol> <li>Review expense lines with short descriptions containing the given hashtag.</li> <li>Identify expense lines that have the same short description, which are considered duplicates.</li> </ol> <h3>2. Apply Rules to Handle Duplicates</h3> <ol> <li>Among duplicates, keep only those linked to tasks (e.g., Change Request, Incident) and delete the others.</li> <li>If all duplicates are linked to tasks, or none are linked to tasks, keep only the oldest one.</li> <li>If all duplicates have the same date, keep only the most expensive one.</li> <li>Finally, if all duplicates have the same cost, you can keep any of the expenses.</li> </ol> <h2>Conclusion</h2> <p>Following these guidelines will help you manage your existing expenses effectively, ensuring compliance with company policies and maintaining accurate financial records. For any issues or additional assistance, please contact the finance department.</p> <hr> <p>This document serves as a guide to ensure proper management of expenses within the organization.</p>"
    },
    {
        "item": "Maximizing total investment return",
        "article": "<h1>Maximizing Total Investment Return</h1><h2>Introduction</h2><p>Investment projects are filed as expense lines and are tagged with project IDs (hashtags) so they can be grouped. Expense lines can be found <a href='./now/nav/ui/classic/params/target/fm_expense_line_list.do'>here</a>. Maximizing total investment return involves reviewing these expense lines and selecting the ones that maximize revenue while fitting within the allowed budget. The investment's returns are specified in their short descriptions and their costs appear in their \"Amount\" field. Depending on the specifics of the task, you may be required to provide different types of information.</p><h2>Steps for Maximizing Total Investment Return</h2><h3>1. Review Expense Lines</h3><ol>    <li>Identify expense lines with short descriptions containing the given hashtag.</li>    <li>Evaluate the returns based on the short description and costs based on the \"Amount\" field to determine their suitability based on the allowed budget.</li></ol><h3>2. Provide Required Information</h3><p>Depending on the task requirements, you may need to provide one or more of the following:</p><ul>    <li><strong>Total Return of Selected Investments Only:</strong> If requested, provide only the total return of the selected investments in the chat.</li>    <li><strong>Selected Investments Only:</strong> If requested, provide the values for the \"Number\" field of the selected investments in the chat.</li>    <li><strong>Selected Investments and Total Return:</strong> If requested, provide the values for the \"Number\" field of the selected investments as well as their total return in the chat.</li>    <li><strong>Investment Lines Cleanup:</strong> If requested, delete the investments that will not be kept so that only the selected investments remain.</li></ul><h2>Conclusion</h2><p>Following these steps will help you allocate investments effectively, ensuring that the selected projects maximize revenue while adhering to the budget constraints. For any issues or additional assistance, please contact the finance department.</p><hr><p>This document serves as a guide to ensure proper management and allocation of investments within the organization.</p>"
    },
    {
        "item": "Dashboard Retrieve Information and Perform Task",
        "article": "<h1>Dashboard Retrieve Information and Perform Task</h1><h2>Introduction</h2><p>Dashboards consists of either bar plots or pie charts containing important information, generally as a pair of some text and numbers. You would be asked to retrieve some information from the chart, which might be retrieving values such as the maximum and minimum value or requiring standard mathematical calculations such as mean, median, and mode. You may also require to extract the text associated with these values, such as the name of an agent. Once they are retrieved, you would be requested to perform a task using this information. Please note that we round off everything to the next <i>highest</i> integer and treat it as the 'value' for the task. For calculations having more than one possible answer (such as 'mode' or 'most frequent' values), we consider the greatest number as the value or information.</p><h2>Steps for performing dashboard retrieval tasks</h2><h3>1. Retrieve information from the dashboard</h3><ol><li>Go to Reports > View/Run in the all menu. You can go to the page <a href='./now/nav/ui/classic/params/target/report_home.do%3Fjvar_selected_tab%3DmyReports'>here</a> as well.</li><li>Use the hashtag given in the task description to filter out the required dashboard chart and navigate to it.</li><li>Based on the task description, you will be given a 'value' field. This would mention if you need to fetch the minimum or maximum valued information or the mean, median, or the mode.</li><li>In certain cases, the description will also mention if you need to perform the following task by considering 'greater than or equal to' or 'lesser than or equal to' values for the retrieved information.</li></ol><p> This is the retrieved information from the dashboard.</p><h3>2. Perform the task</h3><p>After retrieving the information, you would be given a task to solve. Depending on the task requirements, you may need to perform one or more of the following:</p><ul><li><strong>Create form entries:</strong> Fill forms with the given information. Only fill the fields mentioned in the task description.</li><li><strong>Filter lists:</strong> Filter the lists using the attribute mentioned in the task description and following the retrieved information.</li><li><strong>Order items:</strong> You would need to go to the service catalog and order an item after making some calculations of the quantity as per the task description.</li></ul><p>The following links may be helpful for achieving the above tasks:</p><ul><li>Create <a href='./now/nav/ui/classic/params/target/incident_list.do'>incidents</a>, <a href='./now/nav/ui/classic/params/target/problem_list.do'>problems</a> or <a href='./now/nav/ui/classic/params/target/sc_req_item_list.do'>item requests</a></li><li>Lists: <a href='./now/nav/ui/classic/params/target/alm_asset_list.do'>asset list</a>, <a href='./now/nav/ui/classic/params/target/alm_hardware_list.do'>hardware list</a>, <a href='./now/nav/ui/classic/params/target/incident_list.do'>incident list</a>, <a href='./now/nav/ui/classic/params/target/sys_user_list.do'>user list</a></li> <li><a href='./now/nav/ui/classic/params/target/catalog_home.do%3Fsysparm_view%3Dcatalog_default'>Service catalog</a> for ordering items</li></ul><h2>Conclusion</h2><p>Following these steps will help you achieve the task of retrieving information from a dashboard and using it to solve another task.</p><hr><p>This document serves as a guide to ensure proper management and allocation of investments within the organization.</p>"
    }
]
